public_html/Books Review/Professional Linux Kernel Architecture/Appendix A: Architecture Specifics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Appendix A: Architecture Specifics Notes</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Appendix A: Architecture Specifics Notes"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-13 10:58:10 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Appendix A: Architecture Specifics Notes</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Data types</a></li>
<li><a href="#sec-2">Alignment</a></li>
<li><a href="#sec-3">Memory Pages</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Data types</h2>
<div class="outline-text-2" id="text-1">

<p>内核在如下3个基本数据类型重做一些基本区别：
</p><ul>
<li>在C程序中标准的数据类型；如unsigned long，void *和char。
</li>
<li>固定比特数的数据类型。定义在=&lt;asm-generic/int-ll64.h&gt;=
</li>
</ul>




<pre class="src src-c"><span style="color: #00ffff;">typedef</span> __signed__ <span style="color: #98fb98;">char</span> <span style="color: #98fb98;">__s8</span>;
<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">unsigned</span> <span style="color: #98fb98;">char</span> <span style="color: #98fb98;">__u8</span>;

<span style="color: #00ffff;">typedef</span> __signed__ <span style="color: #98fb98;">short</span> <span style="color: #98fb98;">__s16</span>;
<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">unsigned</span> <span style="color: #98fb98;">short</span> <span style="color: #98fb98;">__u16</span>;

<span style="color: #00ffff;">typedef</span> __signed__ <span style="color: #98fb98;">int</span> <span style="color: #98fb98;">__s32</span>;
<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">unsigned</span> <span style="color: #98fb98;">int</span> <span style="color: #98fb98;">__u32</span>;

<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">signed</span> <span style="color: #98fb98;">char</span> <span style="color: #98fb98;">s8</span>;
<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">unsigned</span> <span style="color: #98fb98;">char</span> <span style="color: #98fb98;">u8</span>;

<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">signed</span> <span style="color: #98fb98;">short</span> <span style="color: #98fb98;">s16</span>;
<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">unsigned</span> <span style="color: #98fb98;">short</span> <span style="color: #98fb98;">u16</span>;

<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">signed</span> <span style="color: #98fb98;">int</span> <span style="color: #98fb98;">s32</span>;
<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">unsigned</span> <span style="color: #98fb98;">int</span> <span style="color: #98fb98;">u32</span>;

<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">signed</span> <span style="color: #98fb98;">long</span> <span style="color: #98fb98;">long</span> <span style="color: #98fb98;">s64</span>;
<span style="color: #00ffff;">typedef</span> <span style="color: #98fb98;">unsigned</span> <span style="color: #98fb98;">long</span> <span style="color: #98fb98;">long</span> <span style="color: #98fb98;">u64</span>;
</pre>

<ul>
<li>不会直接使用的子系统特有的类型，但经常被特有的函数所用。比如类型
  pid<sub>t用来处理pids和sector</sub><sub>t用来指明扇区数。</sub>
</li>
</ul>





<p class="info">infoThe pre-processor constant =__KERNEL__=  must
always be defined before the file is linked into the kernel source.</p>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Alignment</h2>
<div class="outline-text-2" id="text-2">

<p>在内核的某些地方可能需要处理非对齐数据类型。为了这目的，不同的体系需要
定义2个不同的宏（在=&lt;asm-generic/unaligned.h&gt;=）：
</p><ul>
<li>get<sub>unaligned</sub>(ptr)
</li>
<li>put<sub>unaligned</sub>(val, ptr)
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Memory Pages</h2>
<div class="outline-text-2" id="text-3">

<p><code>asm-generic/page.h</code> to indicate the page size used:
</p>


<pre class="src src-c"><span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">PAGE_SHIFT</span>      12
<span style="color: #b0c4de;">#ifdef</span> __ASSEMBLY__
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">PAGE_SIZE</span>       (1 &lt;&lt; PAGE_SHIFT)
<span style="color: #b0c4de;">#else</span>
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">PAGE_SIZE</span>       (1UL &lt;&lt; PAGE_SHIFT)
<span style="color: #b0c4de;">#endif</span>
<span style="color: #b0c4de;">#define</span> <span style="color: #eedd82;">PAGE_MASK</span>       (~(PAGE_SIZE-1))
</pre>


<ul>
<li>PAGE<sub>SHIFT</sub> specifies the binary logarithm of the page size.
</li>
<li>PAGE<sub>SIZE</sub> specifies the size of a memory page in bytes.
</li>
<li>PAGE<sub>ALIGN</sub>
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-13 10:58:10 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
